{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "Urls": "http://0.0.0.0:51285",
  "ConnectionStrings": {
    "LocalDb": "Data Source=TypingMasterDatabase.db"
  },
  "ServerMode": false,
  "TypingTest": {
    "TypingTestTexts": [
      {
        "Type": "Minimalistic",
        "Text": "Przysłowiowy kot."
      },
      {
        "Type": "Minimalistic",
        "Text": "Miłość jest ślepa."
      },
      {
        "Type": "Minimalistic",
        "Text": "Szczęśliwe zakończenie."
      },
      {
        "Type": "Minimalistic",
        "Text": "Skok w dal."
      },
      {
        "Type": "Minimalistic",
        "Text": "Cisza przed burzą."
      },
      {
        "Type": "Short",
        "Text": "Nie bądź bierny, działaj samodzielnie."
      },
      {
        "Type": "Short",
        "Text": "Zawsze powtarzaj pozytywne myśli."
      },
      {
        "Type": "Short",
        "Text": "Szanuj ludzi, którzy cię otaczają."
      },
      {
        "Type": "Short",
        "Text": "Zdrowie to nasz największy skarb."
      },
      {
        "Type": "Short",
        "Text": "Warto poświęcić czas na rozwój osobisty."
      },
      {
        "Type": "Average",
        "Text": "Szukaj motywacji w każdym dniu, aby realizować swoje cele."
      },
      {
        "Type": "Average",
        "Text": "Nie bój się prosić o pomoc, to oznaka siły, a nie słabości."
      },
      {
        "Type": "Average",
        "Text": "Słuchaj uważnie i bądź otwarty na różne punkty widzenia."
      },
      {
        "Type": "Average",
        "Text": "Wszyscy popełniamy błędy, ale to nasze doświadczenia uczą nas mądrości."
      },
      {
        "Type": "Average",
        "Text": "Nie pozwól, aby przeszłość definiowała twoją przyszłość."
      },
      {
        "Type": "Long",
        "Text": "Czemuż nie ma jeszcze pizzy? Czekam już godzinę i nic. Może jednak zamówić coś innego?"
      },
      {
        "Type": "Long",
        "Text": "Właśnie skończyłem pisać swoją nową powieść. Przeczytaj ją, jeśli lubisz literaturę science fiction"
      },
      {
        "Type": "Long",
        "Text": "Mam dobre wieści! Otrzymałem dzisiaj awans w pracy. Oto nagroda za ciężką pracę i poświęcenie."
      },
      {
        "Type": "Long",
        "Text": "Czuję się tak zmęczony, że chciałbym tylko leżeć w łóżku i odpocząć przez resztę dnia. A może warto zrobić sobie krótką drzemkę?"
      },
      {
        "Type": "Long",
        "Text": "Zaczynam kurs programowania od podstaw i jestem pod wrażeniem, jak dużo można się nauczyć w tak krótkim czasie. To prawdziwie fascynujące."
      },
      {
        "Type": "VeryLong",
        "Text": "Cześć! Jak się masz? Dziś jest piękny dzień, pełen słońca i pozytywnej energii. Co u Ciebie słychać? Mam nadzieję, że wszystko idzie po Twojej myśli i że masz wspaniały dzień!"
      },
      {
        "Type": "VeryLong",
        "Text": "W dzisiejszych czasach ludzie coraz częściej szukają sposobów na poprawę swojego zdrowia i samopoczucia. Od jogi po zdrowe odżywianie, możliwości jest wiele!"
      },
      {
        "Type": "VeryLong",
        "Text": "Czasem warto zrobić sobie przerwę od codzienności i pozwolić sobie na chwilę relaksu. Może to być kąpiel z olejkami eterycznymi lub leniwe popołudnie z książką w ręku."
      },
      {
        "Type": "VeryLong",
        "Text": "Kreatywność to nie tylko talent, ale także umiejętność rozwijania swoich pomysłów i poszukiwania nowych rozwiązań. Każdy może się jej nauczyć!"
      },
      {
        "Type": "VeryLong",
        "Text": "Nauka nowego języka to świetny sposób na rozwijanie swoich umiejętności i poznawanie nowych kultur. W dzisiejszych czasach jest to łatwiejsze niż kiedykolwiek wcześniej, dzięki szerokiemu dostępowi do materiałów edukacyjnych i narzędzi online."
      }
    ]
  }
}